package stay;

/**
 * @ClassName: stay.UserStayTime
 * @description: TODO
 * @author: zzy
 * @date: 2019-04-17 21:34
 * @version: V1.0
 **/
public class UserStayTime {
    /*
input:
product_no      lac_id      moment  start_time                          user_id     county_id   staytime    city_id
13429100031     22554       8       2013-03-11 08:55:19.151754088       571         571         282         571
13429100082     22540       8       2013-03-11 08:58:20.152622488       571         571         270         571
13429100082     22691       8       2013-03-11 08:56:37.149593624       571         571         103         571
13429100087     22705       8       2013-03-11 08:56:51.139539816       571         571         220         571
13429100087     22540       8       2013-03-11 08:55:45.150276800       571         571         66          571
13429100082     22540       8       2013-03-11 08:55:38.140225200       571         571         133         571
13429100140     26642       9       2013-03-11 09:02:19.151754088       571         571         18          571
13429100082     22691       8       2013-03-11 08:57:32.151754088       571         571         287         571
13429100189     22558       8       2013-03-11 08:56:24.139539816       571         571         48          571
13429100349     22503       8       2013-03-11 08:54:30.152622440       571         571         211         571

字段解释：
product_no：用户手机号；
lac_id：用户所在基站；
start_time：用户在此基站的开始时间；
staytime：用户在此基站的逗留时间。

需求描述：
根据 lac_id 和 start_time 知道用户当时的位置，根据 staytime 知道用户各个基站的逗留时
长。根据轨迹合并连续基站的 staytime。
最终得到每一个用户按时间排序在每一个基站驻留时长

期望输出举例：
13429100082 22540 8 2013-03-11 08:58:20.152622488 571 571 270 571
13429100082 22691 8 2013-03-11 08:56:37.149593624 571 571 390 571
13429100082 22540 8 2013-03-11 08:55:38.140225200 571 571 133 571
13429100087 22705 8 2013-03-11 08:56:51.139539816 571 571 220 571
13429100087 22540 8 2013-03-11 08:55:45.150276800 571 571 66 571
     */

    /*
select product_no, lac_id, moment, start_time, user_id, county_id, staytime, city_id from stay distribute by product_no sort by product_no asc, start_time asc;

select product_no, lac_id, moment, start_time, user_id, county_id, staytime, city_id from stay cluster by product_no, start_time;
     */
}
